# Fifa19 Exercise - Solutions

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [Fifa19 Dataset](https://www.kaggle.com/winterbreeze/fifa19eda) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:\\Users\\ElQaiaty Store\\Downloads\\fifa_eda\\fifa_eda.csv")
df.head()

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,110500.0,565.0,Left,5.0,4.0,RF,2004,2021-01-01,5.583333,159.0,226500.0
1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,77000.0,405.0,Right,5.0,5.0,ST,2018,2022-01-01,6.166667,183.0,127100.0
2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,118500.0,290.0,Right,5.0,5.0,LW,2017,2022-01-01,5.750000,150.0,228100.0
3,193080,De Gea,27,Spain,91,93,Manchester United,72000.0,260.0,Right,4.0,1.0,GK,2011,2020-01-01,6.333333,168.0,138600.0
4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,102000.0,355.0,Right,4.0,4.0,RCM,2015,2023-01-01,5.916667,154.0,196400.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18207 entries, 0 to 18206
Data columns (total 18 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        18207 non-null  int64
 1   Name                      18207 non-null  object
 2   Age                       18207 non-null  int64
 3   Nationality               18207 non-null  object
 4   Overall                   18207 non-null  int64
 5   Potential                 18207 non-null  int64
 6   Club                      17966 non-null  object
 7   Value                     17955 non-null  float64
 8   Wage                      18207 non-null  float64
 9   Preferred Foot            18207 non-null  object
 10  International Reputation  18159 non-null  float64
 11  Skill Moves               18159 non-null  float64
 12  Position                  18207 non-null  object
 13  Joined                    18207 non-null  int64
 14  Contract Valid Until      17918 non-null  object
 15  Height                    18207 non-null  float64
 16  Weight                    18207 non-null  float64
 17  Release Clause            18207 non-null  float64
dtypes: float64(7), int64(5), object(6)
memory usage: 2.5+ MB

In [4]:
df.describe()

,ID,Age,Overall,Potential,Value,Wage,International Reputation,Skill Moves,Joined,Height,Weight,Release Clause
count,18207.000000,18207.000000,18207.000000,18207.000000,17955.000000,18207.000000,18159.000000,18159.000000,18207.000000,18207.000000,18207.000000,18207.000000
mean,214298.338606,25.122206,66.238699,71.307299,2444.530214,9.731312,1.113222,2.361308,2016.420607,5.946771,165.979129,4585.060971
std,29965.244204,4.669943,6.908930,6.136496,5626.715434,21.999290,0.394031,0.756164,2.018194,0.220514,15.572775,10630.414430
min,16.000000,16.000000,46.000000,48.000000,10.000000,0.000000,1.000000,1.000000,1991.000000,5.083333,110.000000,13.000000
25%,200315.500000,21.000000,62.000000,67.000000,325.000000,1.000000,1.000000,2.000000,2016.000000,5.750000,154.000000,570.000000
50%,221759.000000,25.000000,66.000000,71.000000,700.000000,3.000000,1.000000,2.000000,2017.000000,5.916667,165.000000,1300.000000
75%,236529.500000,28.000000,71.000000,75.000000,2100.000000,9.000000,1.000000,3.000000,2018.000000,6.083333,176.000000,4585.060806
max,246620.000000,45.000000,94.000000,95.000000,118500.000000,565.000000,5.000000,5.000000,2018.000000,6.750000,243.000000,228100.000000

In [5]:
df.isna().sum()

ID                            0
Name                          0
Age                           0
Nationality                   0
Overall                       0
Potential                     0
Club                        241
Value                       252
Wage                          0
Preferred Foot                0
International Reputation     48
Skill Moves                  48
Position                      0
Joined                        0
Contract Valid Until        289
Height                        0
Weight                        0
Release Clause                0
dtype: int64

In [6]:
df['Contract Valid Until'] = pd.to_datetime(df['Contract Valid Until'])

In [8]:
df[df.isnull().any(axis=1)]

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
452,207439,L. Paredes,24,Argentina,80,85,NaN,NaN,0.0,Right,2.0,4.0,CM,2016,NaT,5.916667,165.0,4585.060806
538,156713,A. Granqvist,33,Sweden,80,80,NaN,NaN,0.0,Right,2.0,2.0,LCB,2016,NaT,6.333333,185.0,4585.060806
568,229909,A. Lunev,26,Russia,79,81,NaN,NaN,0.0,Right,1.0,1.0,GK,2016,NaT,6.166667,176.0,4585.060806
677,187347,I. Smolnikov,29,Russia,79,79,NaN,NaN,0.0,Right,2.0,3.0,RB,2016,NaT,5.833333,154.0,4585.060806
864,153260,Hilton,40,Brazil,78,78,Montpellier HSC,NaN,18.0,Right,2.0,3.0,CB,2011,2019-01-01,5.916667,172.0,4585.060806
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17539,234508,C. Singh,21,India,53,62,NaN,NaN,0.0,Right,1.0,2.0,LB,2016,NaT,6.250000,174.0,4585.060806
17672,237744,R. Kawai,39,Japan,53,53,Hokkaido Consadole Sapporo,NaN,1.0,Right,1.0,2.0,CB,2011,2021-01-01,6.000000,165.0,4585.060806
17726,51963,T. Warner,44,Trinidad & Tobago,53,53,Accrington Stanley,NaN,1.0,Right,1.0,1.0,GK,2018,2019-01-01,6.333333,185.0,4585.060806
17752,100899,S. Phillips,40,England,52,52,Yeovil Town,NaN,1.0,Right,1.0,1.0,GK,2017,2022-01-01,6.083333,165.0,4585.060806
18183,53748,K. Pilkington,44,England,48,48,Cambridge United,NaN,1.0,Right,1.0,1.0,GK,2018,2023-01-01,6.166667,190.0,4585.060806

In [8]:
len(df)

18207

In [9]:
df.isna().sum() * 100 / len(df)

ID                          0.000000
Name                        0.000000
Age                         0.000000
Nationality                 0.000000
Overall                     0.000000
Potential                   0.000000
Club                        1.323667
Value                       1.384083
Wage                        0.000000
Preferred Foot              0.000000
International Reputation    0.263635
Skill Moves                 0.263635
Position                    0.000000
Joined                      0.000000
Contract Valid Until        1.587302
Height                      0.000000
Weight                      0.000000
Release Clause              0.000000
dtype: float64

In [10]:
df = df.dropna()

In [11]:
df.isna().sum()

ID                          0
Name                        0
Age                         0
Nationality                 0
Overall                     0
Potential                   0
Club                        0
Value                       0
Wage                        0
Preferred Foot              0
International Reputation    0
Skill Moves                 0
Position                    0
Joined                      0
Contract Valid Until        0
Height                      0
Weight                      0
Release Clause              0
dtype: int64

**What is the mean & median Age ?**

In [16]:
Mean_Age = df["Age"].mean()
Median_Age = df['Age'].median()
print(f"Mean Age is: {Mean_Age:.1f} ")
print(f"Median Age is: {Median_Age} ")

Mean Age is: 25.1
Median Age is: 25.0

In [18]:
mean_age = df['Age'].mean()
median_age = df['Age'].median()
print(f'mean age is: {mean_age:.2f}')
print(f'median age is: {median_age}')

mean age is: 25.10
median age is: 25.0

**What is the greatest Height? and name of the player with that height?**

In [19]:
df.columns = df.columns.str.lower().str.strip()

In [20]:
df['height'].max()

np.float64(6.75)

In [24]:
df[df['height']== df['height'].max()][['height','name']]

       height       name
11614    6.75    T. Holý
17927    6.75  D. Hodzic

**What is the smallest weight? and name of the player with that weight? and for which club plays?**

In [25]:
df['weight'].min()

np.float64(110.0)

In [26]:
df[df['weight']== df['weight'].min()][['weight','name']]

       weight           name
13338   110.0  B. Al Mutairi
17157   110.0   K. Yamaguchi

**What is the position of Cristiano Ronaldo?**

In [29]:
df[df['name']== 'Cristiano Ronaldo']['position']

1    ST
Name: position, dtype: object

**What was the average (mean) Value of all players per year(Joined column) ?**

In [32]:
df['year']= df['contract valid until'].dt.year

In [36]:
df.groupby('year')['value'].mean().reset_index()

   year         value
0  2018    961.986434
1  2019   1504.916314
2  2020   2135.631800
3  2021   2572.085819
4  2022   5485.006780
5  2023   5067.997146
6  2024  24042.391304
7  2025  16230.000000
8  2026  25550.000000

**get Number of players for each club**

In [37]:
df.groupby('club')['id'].count().reset_index()

                      club  id
0      SSV Jahn Regensburg  29
1    1. FC Heidenheim 1846  28
2     1. FC Kaiserslautern  26
3               1. FC Köln  28
4          1. FC Magdeburg  26
..                     ...  ..
646     Zagłębie Sosnowiec  25
647        Çaykur Rizespor  30
648              Örebro SK  27
649          Östersunds FK  22
650          Śląsk Wrocław  24

[651 rows x 2 columns]

**How many unique Clubs are there?**

In [38]:
df['club'].nunique()

651

**What are the top 5 most common positions?**

In [39]:
df['position'].value_counts().head(5).reset_index()

  position  count
0       ST   2130
1       GK   1989
2       CB   1751
3       CM   1377
4       LB   1304

**What are the top 5 most common nationality?**

In [40]:
df['nationality'].value_counts().head(5).reset_index()

  nationality  count
0     England   1655
1     Germany   1195
2       Spain   1071
3   Argentina    935
4      France    910

**What are the names of players has Egyptian Nationality?**

In [45]:
df['name'][df['nationality']== 'Egypt']

26             M. Salah
752           Trezeguet
959           M. Elneny
1517          A. Hegazi
2241          A. Hassan
2334           R. Sobhi
3310      A. Elmohamady
3616           A. Warda
3929          A. Ghazal
4044           A. Tarek
4504         A. El Said
5944           S. Morsy
7102     M. Abdul Shafy
8325          A. El-Abd
9228        H. El Sayed
9297            M. Awad
9514        A. Jakobsen
9665           K. Hafez
10672           M. Atwa
13891        A. Mostafa
Name: name, dtype: object

**How many players joined in 2018 with skill moves=2?**

In [55]:
df[(df['joined']==2018) & (df['skill moves']== 2)].shape[0]

3295

**How many players whom name starts with letter  'M'? (This is pretty tricky)**

In [56]:
df[df['name'].str.startswith('M')].shape[0]

1948

**Bonus: Is there a correlation between International Reputation and Wage?**

In [58]:
df[['international reputation' , 'wage']].corr()

                          international reputation      wage
international reputation                  1.000000  0.671543
wage                                      0.671543  1.000000

---